surfaceWater/runCases/RANS/ChoosingTurbulenceModel/3mmx0.1mm_kwSST/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1056
(
3.36645e-05
3.40813e-05
3.46697e-05
3.54852e-05
9.27321e-05
9.6896e-05
0.000201365
0.000208139
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
33
(
3.08239e-06
3.08239e-06
3.39649e-06
3.72448e-06
3.72448e-06
3.60552e-06
3.60552e-06
3.37706e-06
...
)
;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
3.36152e-06
3.36152e-06
3.36152e-06
3.36152e-06
8.19991e-05
8.19991e-05
0.000240145
0.000240145
...
)
;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
3.36152e-06
3.36152e-06
3.36152e-06
3.36152e-06
8.19991e-05
8.19991e-05
0.000240145
0.000240145
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
