surfaceWater/runCases/RANS/ChoosingTurbulenceModel/3mmx0.1mm_kwSST/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            tabulatedAccelerationSource;
    active			yes;
    selectionMode   all;
    fields          (U);
    timeDataFileName "constant/g";
    
}


// ************************************************************************* //
